<img src="https://raw.githubusercontent.com/andre-marcos-perez/ebac-course-utils/main/media/logo/newebac_logo_black_half.png" alt="ebac-logo">

---

# **Módulo** | SQL: Agregações
Caderno de **Aula**<br> 
Professor [Mariane Neiva](www.linkedin.com/in/mariane-neiva)

---

# **Tópicos**

<ol type="1">
  <li>Função count e cláusula group by;</li>
  <li>Funções min / max / sum / avg;</li>
  <li>Cláusula having;</li>
</ol>

---

# **Aulas**

Nessa aula, usaremos a seguinte tabela:

```sql
CREATE TABLE transacoes (
  id_cliente INT, 
  id_transacao INT,
  data_compra DATE,
  valor FLOAT, 
  id_loja varchar(25)
);
```

Também temos os seguintes valores inseridos na tabela

```sql
INSERT INTO transacoes VALUES (1,768805383,'2021-06-10',50.74,'magalu');
INSERT INTO transacoes VALUES (2,768805399,'2021-06-13',30.90,'giraffas');
INSERT INTO transacoes VALUES (3,818770008,'2021-06-05',110.00,'postoshell');
INSERT INTO transacoes VALUES (1,76856563,'2021-07-10',2000.90,'magalu');
INSERT INTO transacoes VALUES (1,767573759,'2021-06-20',15.70,'subway');
INSERT INTO transacoes VALUES (3,818575758,'2021-06-25',2.99,'seveneleven');
INSERT INTO transacoes VALUES (4,764545534,'2021-07-11',50.74,'extra');
INSERT INTO transacoes VALUES (5,76766789,'2021-08-02',10.00,'subway');
INSERT INTO transacoes VALUES (3,8154567758,'2021-08-15',1100.00,'shopee');
```

Como resultado da função SELECT, temos a seguinte tabela:

| id_cliente | id_transacao | data_compra |valor | id_loja |
|------------|----------|----|-----| ------- |
| 1| 768805383    | 2021-06-10    | 50.74 |magalu 
| 2 | 768805399    | 2021-06-13    |  30.90 | giraffas 
| 3 | 818770008    |2021-06-05   |  110.00 |  postoshell  
|1 |76856563 | 2021-07-10 |2000.90 |magalu
|1|767573759|2021-06-20|15.70|subway
| 3|818575758|2021-06-25|2.99|seveneleven
 |4|764545534|2021-07-10|50.74|extra
|5|76766789|2021-08-92|10.00|subway
|3|8154567758|2021-08-15|1100.00|shopee

#1. Função count e cláusula group by

## 1.1 **Função COUNT**

A função **count** retorna a quantidade de linhas na tabela que corresponde a determinada seleção. 

```sql
SELECT COUNT(<nome_coluna>)
FROM <nome_tabela>
WHERE <condicao>;
```

Exemplo:
```sql
SELECT COUNT(id_cliente) AS QUANTIDADE
FROM transacoes
WHERE id_cliente = 1
```

Resultado:

| QUANTIDADE |
|------------|
| 3 |

## **1.2 Cláusula *group by***

O comando GROUP BY agrupa linhas que contém as mesmas condições e sumariza-os. Voce poderia informações por loja, clientes, entre outros critérios pertinentes a cada aplicação.

No SQL Server: 

```sql
SELECT <coluna1>, <coluna2>, ..., 
FROM <nome_tabela>
WHERE <condicao>
GROUP BY <nome_coluna>
ORDER BY <nome_coluna>;
```

No exemplo:


```sql
SELECT COUNT(id_loja) AS #TRANSACOES_LOJA, id_loja AS loja
FROM transacoes
GROUP BY id_loja;
```

Importante: o # não é aceito no SQL Server. Remova-o para testar no site https://sqliteonline.com/.


Resultado:

|#TRANSACOES_LOJA | loja |
|----------------|-------|
|1|extra|
|1|giraffas|
|2|magalu|
|1|postoshell|
|1|seveneleven|
|1|shopee|
|2|subway|

#2. Funções min / max / sum / avg

Diversas funções estão disponível no SQL. Podemos realizar uma análise exploratória no própio Athena ou em outro sistema de banco de dados combinando tudo que aprendemos até agora e o que ainda veremos nesse curso. 

Hoje veremos as principais funções utilizadas no SQL.

## **2.1 Função min**

A função min retorna o menor valor da coluna indicada de acordo com as condições solicitadas.

```sql
SELECT MIN(<nome_coluna>)
FROM <nome_tabela>
WHERE <condicao>;
```

Exemplo:

```sql
SELECT MIN(valor), id_loja
FROM transacoes
WHERE id_cliente = 1;
```

Resultado:

| MIN(valor) | id_loja|
|----|---|
| 15.70| subway|

## **2.2 Função max**

A função max retorna o maior valor da coluna indicada de acordo com as condições solicitadas.

```sql
SELECT MAX(<nome_coluna>)
FROM <nome_tabela>
WHERE <condicao>;
```

Exemplo:

```sql
SELECT MAX(valor), id_loja
FROM transacoes
WHERE id_cliente = 1;
```

Resultado:

| MAX(valor) | id_loja|
|----|---|
| 2000.90| magalu|

## **2.3. Função sum**

A função sum retorna a soma dos valores da coluna indicada de acordo com as condições solicitadas.

```sql
SELECT SUM(<nome_coluna>)
FROM <nome_tabela>
WHERE <condicao>;
```

Exemplo:

```sql
SELECT SUM(valor) 
FROM transacoes
WHERE id_cliente = 1;
```

Resultado:

| SUM(valor) |  
|----| 
| 2067.3399999997|

## **2.4. Função avg**


A função avg retorna a média dos valores da coluna indicada de acordo com as condições solicitadas.

```sql
SELECT AVG(<nome_coluna>)
FROM <nome_tabela>
WHERE <condicao>;
```

Exemplo:

```sql
SELECT AVG(valor) AS media_magalu
FROM transacoes
WHERE id_loja = 'magalu';
```

Resultado:

| media_magalu |  
|----| 
| 1025.82|

# 3. Cláusula having


Quando a condição é acompanhada de uma função (sum, avg, min, max, count, ...) utilizamos o comando HAVING ao invéz do WHERE. 

```sql
SELECT column_name(s)
FROM table_name
GROUP BY column_name(s)
HAVING condition
```

Exemplo:

```sql
SELECT COUNT(id_cliente), id_loja 
FROM transacoes
GROUP BY id_loja
HAVING COUNT(id_cliente) > 1;
```

Resultado: 

| COUNT(id_cliente) | id_loja |
|-|-|
|2 | magalu|
| 2 | subway|